#Полиморфна йерархия
В нашия проект полиморфизмът е осъществен чрез класовете Recipe, HotMeal и ColdMeal, като Recipe е базовият (в случая абстрактен) клас, а HotMeal и 
ColdMeal са съответно неговите наследници. Двата наследника се различават по начина на приготвяне на храната, трудността и евентуалният начин на съхранение
на ястието. Двата вида рецепти имат следните общи признаци:
- Име (1-40 символа), символен низ;
- Списък от съставки (реализиран чрез вектор от чифтове), т.е. всяка съставка съдържа два компонента от различен тип - първият е името на продукта, а вторият
е броят нужни продукти от този вид;
- Рейтинг, чиято коректност се осъществява чрез вектор с елементи от тип unsigned short, който пази всички настоящи оценки, отнасящи се за конкретната 
рецепта, и десетично число, което носи средната стойност на настоящите оценки, съхранявани във вектора (варира от 1 до 5 в общия случай, но поради сложността
на приготвяне на ястията, изискващи термична обработка, приемаме, че последните две нива на трудност могат да бъдат заети само от готвени храни);
- Идентификационен номер или ID, който е гарантирано уникален за всяка рецепта;
- Тип на ястието (измежду следните: салата, супа, печиво, вариво, пържола, сандвич, десерт), съхраняван в enum class;
- Енергийна стойност на ястието, измерена в kcal (400 - 1200 kcal);
- И студените, и топлите храни имат ниво на трудност, което обаче се определя по различен начин, предвид условията на приготвяне, които варират за двата типа
ястия (осъществява се чрез чисто виртуална функция);
- Време за приготвяне (до 3 часа);
- Същинската част на рецептата (инструкциите за приготвяне) - символен низ;

Студените храни се характеризират с температура за съхранение, варираща между (-18, 4) градуса по Целзий (имайки предвид допустимите температури в хладилник
и съответно фризер);

Топлите храни се характеризират с:
- Температура за готвене между (90, 260) градуса по Целзий;
- Време за термична обработка (не може да надвишава общото време за приготвяне), играе важна роля за определянето на сложността на готвеното ястие;
- Списък от кухненски уреди, нужни за приготвянето на храната (котлон, фурна, миксер, и т.н.), осъществява се чрез вектор с елементи стринг (символен низ);

Всички рецепти се пазят в хетерогенен контейнер, реализиран чрез клас RecipeBook, където данните са организирани под формата на вектор от указатели към 
абстрактия клас Recipe. Сортирани са по рейтинг в намаляващ ред;
Функционалностите, които предлага хетерогенния контейнер, са:
- Добавяне на нова рецепта с необходимите параметри (според това дали е топла или студена храна). Тук се генерира идентификационен номер, като се подсигурява, 
  че е уникален за всяка рецепта
- Триене на рецепта по идентификационен номер
- Добавяне на рейтинг към рецепта по идентификационен номер
- Принтиране на всички рецепти
- Принтиране на рецепти по категории - за супи, салати, печива, варива, пържоли, сандвичи, десерти
- Принтиране на рецепти според трудността
